
%% Инициализация
close all
clear
clc

% Двигатель ACM601 -------------------------------------------------
R = 0.75; % сопр статора
Ls = 2e-3;  % индуктивность статора
Te = R*Ls;
zp = 4; % количество пар полюсов
ce = 0.0712; % В/(рад/с)- фазное
cm = 0.0712; % N/A
J = 0.11e-4;

% Инициализация задания----------------------------------------------------
tau=0.00; % 0.02 мертвое время
delU=0; % напряжение открытия ключей
k=2; % для векторной - sqrt(3), для синусоидальной - 2 
Kv=1; % скорость изменения линейно-нарастающего сигнала, град/с
Z=20; % амплитуда скачка
Tpwm=0.5e-4;
Ts1=0.5e-4; % период ШИМ
Ts2=0.5e-3; % 
T0=1e-6; % период дискретизации

PWM_MAX=Tpwm*160000000/2;
% Флаги-переключатели:
add_error=0; % вкл/откл ошибки измерения тока
turn_M=0; % вкл/откл возмущающего воздействия
Sw=0; % переключение задания со скачка на линейно-нарастуающий сигнал
comp=0; % компенсация зубцового момента
PreMod_3=0; % включение предмодуляции 3-й гармоники. Не забыть про k! 

% Параметры инвентора------------------------------------------------------
Udc=8; % питание
Cf = 100e-6;
Rshunt=0.33;
Ron=0.73*0.001;
Kshunt=0.001;
Vf=0.7*0.001;
Isc=Udc/R;
Kenc=2000/(2*pi);
Kopa=1.527;
Ubias=1.558;
KADC=(2^12-1)/3.3;
kdt=Rshunt*Kopa*KADC; % коэффициент датчика тока
Ibias=Ubias/Rshunt/Kopa;
Kob=1/R*(Udc-2*delU)/k;
kda=1; kdb=0.99; kdc=1.015; % Мультипликативные ошибки
dia=0.002*Isc*kdt; dib=0.003*Isc*kdt; dic=-0.009*Isc*kdt; % Аддитивные ошибки
Ra=R; Rb=R; Rc=R; Lsa=Ls; Lsb=Ls; Lsc=Ls; % Нагрузка симметрична

% Зубцовый момент
Nc=72;
Ns=36;
Q1=-90.7*pi/180;
Q2=-61*pi/180;
Mm1=2.232;
Mm2=0.565;
Msc1=2.232/Ns;
Msc2=0.565/Ns;
%alfa=[0:2*pi/(100*Nc):4*pi/Nc];
%Mz=Mm1*sin(Nc*alfa+Q1)+Mm2*sin(2*Nc*alfa+Q2);
%plot(alfa,Mz)
%grid on

%--------------------------------------------------------------------------
% Система регулирования скорости
% Контур тока
% ПФ эквивалентного апериодического звена: Kob/(Te*s+1)
% ПФ разомкнутого ЛО: 1/Tt*s-> ПФ регулятора: (Kp*s+Ki)/s=Ki(Kp/Ki s+1)/s
% Kp/Ki=Te; 1/(Ki*Kob)=Tt -> Ki=1/Kob*Tt ->Kp=Te*Ki
% Ki1=1/(Kob*(Tt+dTs/2)); Kp1=(Te/Kob*(Tt+dTs/2));
%--------------------------------------------------------------------------
Tz=Ts1/2;
Tt=Ts1*10; % желаемое быстродействие
Ki1=1/(Kob*Tt);
Kp1=Te*Ki1
Ki1d=Ki1*Ts1
% Контур скорости - СО
% ПФ разомкнутого контура скорости: 1/(Tt*s+1)*3/2*ce*1/(J*s)
% ПФ разомкнутого СО: (4*Tmu*s+1)/(8*(Tmu*s)^2(Tmu*s+1)) || 1/(2Tmu(Tmu*s+1))
% ПФ регулятора: (Kp*s+Ki)/s=Ki(Kp/Ki s+1)/s || Kp
% Ki2*3/2*ce*1/J = 1/(8*Tmu^2) || Kp*3/2*ce/J = 1/(2Tmu)
% 4*Tmu = Kp/Ki || Kp=2Tmu*2/3*J/ce
%--------------------------------------------------------------------------
Tmu=10*Tt;
Ki2=J*2/(3*8*Tmu^2*ce);
Kp2=4*Tmu*Ki2
Ki2d=Ki2*Ts2
%Ki2=0;
%Kp2=2*J/(3*ce*2*Tmu);